zaoshuizaoxing/JD6628-Eight_Port/Drivers/PY32F031_HAL_Driver/Inc/py32f031_hal_comp.h
/* Private types -------------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup COMP_Private_Constants COMP Private Constants
  * @{
  */

/** @defgroup COMP_WindowMode_Instance_Differentiator COMP window mode instance differentiator
  * @{
  */
#define COMP_WINDOWMODE_COMP2          0x00001000U       /*!< COMP window mode using common input of COMP instance: COMP2 */
/**
  * @}
  */

/** @defgroup COMP_ExtiLine COMP EXTI Lines
  * @{
  */
#define COMP_EXTI_LINE_COMP1           (EXTI_IMR_IM17)  /*!< EXTI line 17 connected to COMP1 output */
#define COMP_EXTI_LINE_COMP2           (EXTI_IMR_IM18)  /*!< EXTI line 18 connected to COMP2 output */

/**
  * @}
  */

/** @defgroup COMP_ExtiLine COMP EXTI Lines
  * @{
  */
#define COMP_EXTI_IT                        (0x00000001UL)  /*!< EXTI line event with interruption */
#define COMP_EXTI_EVENT                     (0x00000002UL)  /*!< EXTI line event only (without interruption) */
#define COMP_EXTI_RISING                    (0x00000010UL)  /*!< EXTI line event on rising edge */
#define COMP_EXTI_FALLING                   (0x00000020UL)  /*!< EXTI line event on falling edge */
/**
  * @}
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup COMP_Private_Macros COMP Private Macros
  * @{
  */

/** @defgroup COMP_GET_EXTI_LINE COMP private macros to get EXTI line associated with comparators
  * @{
  */
/**
  * @brief  Get the specified EXTI line for a comparator instance.
  * @param  __INSTANCE__  specifies the COMP instance.
  * @retval value of @ref COMP_ExtiLine
  */

#define COMP_GET_EXTI_LINE(__INSTANCE__)    (((__INSTANCE__) == COMP1) ? COMP_EXTI_LINE_COMP1  \
                                              :COMP_EXTI_LINE_COMP2)

/**
  * @}
  */

/** @defgroup COMP_IS_COMP_Definitions COMP private macros to check input parameters
  * @{
  */
#define IS_COMP_WINDOWMODE(__WINDOWMODE__)  (((__WINDOWMODE__) == COMP_WINDOWMODE_DISABLE)                || \
                                             ((__WINDOWMODE__) == COMP_WINDOWMODE_COMP1_INPUT_PLUS_COMMON)|| \
                                             ((__WINDOWMODE__) == COMP_WINDOWMODE_COMP2_INPUT_PLUS_COMMON)  )

#define IS_COMP_POWERMODE(__POWERMODE__)    (((__POWERMODE__) == COMP_POWERMODE_HIGHSPEED)    || \
                                             ((__POWERMODE__) == COMP_POWERMODE_MEDIUMSPEED)    )

#define IS_COMP_INPUT_PLUS(__COMP_INSTANCE__, __INPUT_PLUS__) (((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO0)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO1)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO2)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO3)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO4)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO5)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO6))


#define IS_COMP_INPUT_MINUS(__COMP_INSTANCE__, __INPUT_MINUS__) (((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO0)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO1)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO2)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO3)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO4))


#define IS_COMP_HYSTERESIS(__HYSTERESIS__)  (((__HYSTERESIS__) == COMP_HYSTERESIS_DISABLE)   || \
                                             ((__HYSTERESIS__) == COMP_HYSTERESIS_ENABLE))


#define IS_COMP_VREFSRC(__VREF__)           (((__VREF__) == COMP_VREFCMP_SOURCE_VCC)   || \
                                             ((__VREF__) == COMP_VREFCMP_SOURCE_VREFBUF1P024V)   || \
                                             ((__VREF__) == COMP_VREFCMP_SOURCE_VREFBUF1P5V)   || \
                                             ((__VREF__) == COMP_VREFCMP_SOURCE_VREFBUF2P048V)   || \
                                             ((__VREF__) == COMP_VREFCMP_SOURCE_VREFBUF2P5V))


#define IS_COMP_VREFDIV(__VREF__)           (((__VREF__) == COMP_VREFCMP_DIV_1_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_2_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_3_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_4_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_5_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_6_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_7_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_8_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_9_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_10_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_11_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_12_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_13_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_14_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_15_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_16_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_17_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_18_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_19_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_20_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_21_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_22_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_23_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_24_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_25_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_26_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_27_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_28_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_29_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_30_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_31_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_32_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_33_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_34_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_35_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_36_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_37_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_38_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_39_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_40_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_41_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_42_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_43_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_44_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_45_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_46_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_47_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_48_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_49_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_50_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_51_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_52_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_53_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_54_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_55_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_56_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_57_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_58_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_59_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_60_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_61_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_62_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_63_64VREFCMP)   || \
                                             ((__VREF__) == COMP_VREFCMP_DIV_VREFCMP))

#define IS_COMP_OUTPUTPOL(__POL__)          (((__POL__) == COMP_OUTPUTPOL_NONINVERTED) || \
                                             ((__POL__) == COMP_OUTPUTPOL_INVERTED))


#define IS_COMP_TRIGGERMODE(__MODE__)       (((__MODE__) == COMP_TRIGGERMODE_NONE)                 || \
                                             ((__MODE__) == COMP_TRIGGERMODE_IT_RISING)            || \
                                             ((__MODE__) == COMP_TRIGGERMODE_IT_FALLING)           || \
                                             ((__MODE__) == COMP_TRIGGERMODE_IT_RISING_FALLING)    || \
                                             ((__MODE__) == COMP_TRIGGERMODE_EVENT_RISING)         || \
                                             ((__MODE__) == COMP_TRIGGERMODE_EVENT_FALLING)        || \
                                             ((__MODE__) == COMP_TRIGGERMODE_EVENT_RISING_FALLING))

#define IS_COMP_OUTPUT_LEVEL(__OUTPUT_LEVEL__) (((__OUTPUT_LEVEL__) == COMP_OUTPUT_LEVEL_LOW)     || \
                                                ((__OUTPUT_LEVEL__) == COMP_OUTPUT_LEVEL_HIGH))

/**
  * @}
  */

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @addtogroup COMP_Exported_Functions
  * @{
  */

/** @addtogroup COMP_Exported_Functions_Group1
  * @{
  */

/* Initialization and de-initialization functions  **********************************/
HAL_StatusTypeDef HAL_COMP_Init(COMP_HandleTypeDef *hcomp);
HAL_StatusTypeDef HAL_COMP_DeInit(COMP_HandleTypeDef *hcomp);
void              HAL_COMP_MspInit(COMP_HandleTypeDef *hcomp);
void              HAL_COMP_MspDeInit(COMP_HandleTypeDef *hcomp);

#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
/* Callbacks Register/UnRegister functions  ***********************************/
HAL_StatusTypeDef HAL_COMP_RegisterCallback(COMP_HandleTypeDef *hcomp, HAL_COMP_CallbackIDTypeDef CallbackID,
    pCOMP_CallbackTypeDef pCallback);
HAL_StatusTypeDef HAL_COMP_UnRegisterCallback(COMP_HandleTypeDef *hcomp, HAL_COMP_CallbackIDTypeDef CallbackID);
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */
/**
  * @}
  */

/* IO operation functions  *****************************************************/
/** @addtogroup COMP_Exported_Functions_Group2
  * @{
  */
HAL_StatusTypeDef HAL_COMP_Start(COMP_HandleTypeDef *hcomp);
HAL_StatusTypeDef HAL_COMP_Stop(COMP_HandleTypeDef *hcomp);
void              HAL_COMP_IRQHandler(COMP_HandleTypeDef *hcomp);
/**
  * @}
  */

/* Peripheral Control functions  ************************************************/
/** @addtogroup COMP_Exported_Functions_Group3
  * @{
  */
HAL_StatusTypeDef HAL_COMP_Lock(COMP_HandleTypeDef *hcomp);
uint32_t          HAL_COMP_GetOutputLevel(COMP_HandleTypeDef *hcomp);
/* Callback in interrupt mode */
void              HAL_COMP_TriggerCallback(COMP_HandleTypeDef *hcomp);
/**
  * @}
  */

/* Peripheral State functions  **************************************************/
/** @addtogroup COMP_Exported_Functions_Group4
  * @{
  */
HAL_COMP_StateTypeDef HAL_COMP_GetState(COMP_HandleTypeDef *hcomp);
uint32_t              HAL_COMP_GetError(COMP_HandleTypeDef *hcomp);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* PY32F031_HAL_COMP_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
